In [1]:
import pandas as pd
import numpy as np

### Pandas

[Site oficial do Pandas](https://pandas.pydata.org/)

In [2]:
pd.__version__

'2.3.0'

# Manipulando Dados em DataFrames do Pandas

In [3]:
# Cria um dicionário

dados = {'Estado':[ 'Santa Catarina' , 'Rio de Janeiro' , ' Tocantins ','Bahia','Minas Gerais'],
         'Ano': [2004, 2005, 2006, 2007, 2008],
         'Taxa Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [4]:
print(dados)

{'Estado': ['Santa Catarina', 'Rio de Janeiro', ' Tocantins ', 'Bahia', 'Minas Gerais'], 'Ano': [2004, 2005, 2006, 2007, 2008], 'Taxa Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [5]:
# Importa a função DataFrame do Pandas
#from pandas import DataFrame

In [6]:
#Converte o dicionário em um dataframe
df = pd.DataFrame(dados)

In [7]:
#Visualiza as 5 primeiras linhas
df.head()

           Estado   Ano  Taxa Desemprego
0  Santa Catarina  2004              1.5
1  Rio de Janeiro  2005              1.7
2      Tocantins   2006              1.6
3           Bahia  2007              2.4
4    Minas Gerais  2008              2.7

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
#Reorganizando as colunas
pd.DataFrame(dados, columns=['Estado','Taxa Desemprego','Ano'])

           Estado  Taxa Desemprego   Ano
0  Santa Catarina              1.5  2004
1  Rio de Janeiro              1.7  2005
2      Tocantins               1.6  2006
3           Bahia              2.4  2007
4    Minas Gerais              2.7  2008

In [10]:
# Criando outro dataframe com os mesmo dados anteriores mas adicionando uma coluna
df2 = pd.DataFrame(dados, columns=['Estado','Taxa Desemprego','Taxa Crescimento','Ano'],index=['estado1','estado2','estado3','estado4','estado5'])

In [11]:
df2

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3      Tocantins               1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [12]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       [' Tocantins ', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [13]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento     object
Ano                   int64
dtype: object

In [14]:
df2.columns

Index(['Estado', 'Taxa Desemprego', 'Taxa Crescimento', 'Ano'], dtype='object')

In [15]:
# Imprimindo apenas uma coluna do Dataframe
df['Estado']

0    Santa Catarina
1    Rio de Janeiro
2        Tocantins
3             Bahia
4      Minas Gerais
Name: Estado, dtype: object

In [16]:
# Linguagem Python é case sensitive
#df2[ 'estado ']

In [17]:
# Imprimindo apenas duas colunas do Dataframe
df2[['Taxa Desemprego','Ano']]

         Taxa Desemprego   Ano
estado1              1.5  2004
estado2              1.7  2005
estado3              1.6  2006
estado4              2.4  2007
estado5              2.7  2008

In [18]:
df2.index

Index(['estado1', 'estado2', 'estado3', 'estado4', 'estado5'], dtype='object')

In [19]:
# Filtrando pelo índice
df2.filter(items=['estado3'],axis=0)

              Estado  Taxa Desemprego Taxa Crescimento   Ano
estado3   Tocantins               1.6              NaN  2006

# Usando NumPy e Pandas Para Manipulação de Dados

In [20]:
df2.head()

                 Estado  Taxa Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina              1.5              NaN  2004
estado2  Rio de Janeiro              1.7              NaN  2005
estado3      Tocantins               1.6              NaN  2006
estado4           Bahia              2.4              NaN  2007
estado5    Minas Gerais              2.7              NaN  2008

In [21]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento     object
Ano                   int64
dtype: object

In [23]:
# Resumo estatístico do Dataframe
df2.describe()
#Apenas valores numéricos

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [25]:
#Verificação de valores ausentes
df2.isna()

         Estado  Taxa Desemprego  Taxa Crescimento    Ano
estado1   False            False              True  False
estado2   False            False              True  False
estado3   False            False              True  False
estado4   False            False              True  False
estado5   False            False              True  False

In [26]:
#Verificação de valores ausentes por coluna
df2['Taxa Crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa Crescimento, dtype: bool

In [28]:
# Usando o NumPy para alimentar uma das colunas do dataframe
df2['Taxa Crescimento'] = np.arange(5.)

In [29]:
df2

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3      Tocantins               1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007
estado5    Minas Gerais              2.7               4.0  2008

In [30]:
df2.dtypes

Estado               object
Taxa Desemprego     float64
Taxa Crescimento    float64
Ano                   int64
dtype: object

In [31]:
#Verificação de valores ausentes por coluna
df2['Taxa Crescimento'].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa Crescimento, dtype: bool

In [32]:
# Resumo estatístico do Dataframe
df2.describe()

       Taxa Desemprego  Taxa Crescimento          Ano
count         5.000000          5.000000     5.000000
mean          1.980000          2.000000  2006.000000
std           0.535724          1.581139     1.581139
min           1.500000          0.000000  2004.000000
25%           1.600000          1.000000  2005.000000
50%           1.700000          2.000000  2006.000000
75%           2.400000          3.000000  2007.000000
max           2.700000          4.000000  2008.000000

# Slicing de DataFrames do Pandas

In [33]:
df2

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3      Tocantins               1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007
estado5    Minas Gerais              2.7               4.0  2008

In [34]:
df2['estado2':'estado4']

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado2  Rio de Janeiro              1.7               1.0  2005
estado3      Tocantins               1.6               2.0  2006
estado4           Bahia              2.4               3.0  2007

In [41]:
df2[df2['Taxa Desemprego'] < 2]

                 Estado  Taxa Desemprego  Taxa Crescimento   Ano
estado1  Santa Catarina              1.5               0.0  2004
estado2  Rio de Janeiro              1.7               1.0  2005
estado3      Tocantins               1.6               2.0  2006

In [36]:
df2[['Estado','Taxa Crescimento']]

                 Estado  Taxa Crescimento
estado1  Santa Catarina               0.0
estado2  Rio de Janeiro               1.0
estado3      Tocantins                2.0
estado4           Bahia               3.0
estado5    Minas Gerais               4.0

In [42]:
df2['Estado']

estado1    Santa Catarina
estado2    Rio de Janeiro
estado3        Tocantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [43]:
df2[['Estado','Taxa Crescimento','Ano']]

                 Estado  Taxa Crescimento   Ano
estado1  Santa Catarina               0.0  2004
estado2  Rio de Janeiro               1.0  2005
estado3      Tocantins                2.0  2006
estado4           Bahia               3.0  2007
estado5    Minas Gerais               4.0  2008

# Preenchendo Valores Ausentes em DataFrames do Pandas (NaN)

In [44]:
#Primeiro importamos um dataset
dsa_df = pd.read_csv('dataset.csv')

In [45]:
dsa_df.head()

,ID_Pedido,Data_Pedido,ID_Cliente,Segmento,Pais,Regiao,ID_Produto,Categoria,Nome_Produto,Valor_Venda,Quantidade
0,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-BO-10001798,Furniture,Bush Somerset Collection Bookcase,261.9600,NaN
1,CA-2016-152156,2016-11-08,CG-12520,Consumer,United States,South,FUR-CH-10000454,Furniture,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,NaN
2,CA-2016-138688,2016-06-12,DV-13045,Corporate,United States,West,OFF-LA-10000240,Office Supplies,Self-Adhesive Address Labels for Typewriters b...,14.6200,2.0
3,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,FUR-TA-10000577,Furniture,Bretford CR4500 Series Slim Rectangular Table,957.5775,5.0
4,US-2015-108966,2015-10-11,SO-20335,Consumer,United States,South,OFF-ST-10000760,Office Supplies,Eldon Fold 'N Roll Cart System,22.3680,2.0

In [ ]:
#Contagem de valores ausentes por coluna
dsa_df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      2
dtype: int64

In [ ]:
# Extraímos a moda da coluna Quantity
moda = dsa_df['Quantidade'].value_counts()

In [48]:
print(moda)

Quantidade
3.0     2408
2.0     2401
5.0     1230
4.0     1191
1.0      899
7.0      606
6.0      572
9.0      258
8.0      257
10.0      57
11.0      34
14.0      29
13.0      27
12.0      23
Name: count, dtype: int64

In [49]:
# Extraímos a moda da coluna Quantity
moda = dsa_df['Quantidade'].value_counts().index[0]

In [50]:
print(moda)

3.0

In [53]:
# E por fim preenchemos os valores NA com a moda
#dsa_df['Quantidade'].fillna(value=moda,inplace=True)
dsa_df['Quantidade'] = dsa_df['Quantidade'].fillna(value=moda)

In [54]:
#Contagem de valores ausentes por coluna
dsa_df.isna().sum()

ID_Pedido       0
Data_Pedido     0
ID_Cliente      0
Segmento        0
Pais            0
Regiao          0
ID_Produto      0
Categoria       0
Nome_Produto    0
Valor_Venda     0
Quantidade      0
dtype: int64